Tekla.Structures.Dialog.Dialogs
The Dialogs class contains interface methods for Tekla Structures to handle FormBase dialogs.

Tekla.Structures.Dialog.Dialogs.LoadDialogs(System.String)
Reads the PluginFormBase dialogs from all found dll files in bin\dialogs and bin\plugins.
param: Not used.
Returns: 0 always. The return value is not useful because it is not sent to the Tekla Structures core.

Tekla.Structures.Dialog.Dialogs._lastOpenedDialog
Because we don´t support multiple dialog we need to save the last opened dialog.